list_1 = [1,2,3,2,12,3,1,3,21,2,2,3,4111,22,3333,444,111,4,5,777,65555,45,33,45]
list_2 = []
for i in range(len(list_1)):
    list_2.append(list_1[i])
    for j in range(len(list_2)-1,0,-1):
        if list_2[j] < list_2[j-1]:
            list_2[j],list_2[j-1] = list_2[j-1],list_2[j]
        else:
            break
print list_2


'''
流程:
1. 从list_1中从左到右遍历每一个元素
2. 将list_1遍历到元素追加到list_2后
3. 从list_2最后一位起与前一位判断大小，若小于前面进行交换, 继续与交换后的前一位比较，直到比不小于（大于或者等于）前一位结束，或着移动到list_2的索引为0的位置结束
4. 重复2,3步骤

评注:
1. 排序结果正确
2. 使用了插入算法实现list从小到大排序
3. 借助了新的一个list_2实现的

改进:
1. 可以考虑在原来的list的上进行排序, 我们可以认为索引为0的元素就是一个有序的，从索引为1的元素开始遍历，和前面的每个元素进行比较，如果比前面的数字小，则进行交换，并和前面的元素进行比较，直到不小于前面的元素或者已经没有元素可以比较，就结束本次排序
2. 遍历list下一个元素并进行排序


list_1 = [1,2,3,2,12,3,1,3,21,2,2,3,4111,22,3333,444,111,4,5,777,65555,45,33,45]
for i in range(len(list_1)):
    for j in range(i, 0, -1):
        if list_1[j] < list_1[j-1]:
            list_1[j],list_1[j-1] = list_1[j-1],list_1[j]
        else:
            break

print list_1


加油
'''
