#!/usr/bin/python
#coding:utf-8
#插入排序

# 方法一
l1 = [1,2,3,2,12,3,1,3,21,2,2,3,4111,22,3333,444,111,4,5,777,65555,45,33,45]
_count = 0

for i in range(0,len(l1)):
    for j in range(i+1,len(l1)):
        _count+=1
        while l1[i] > l1[j]:
            l1[i],l1[j] = l1[j],l1[i]
print l1
print _count

# 方法二
l2 = [1,2,3,2,12,3,1,3,21,2,2,3,4111,22,3333,444,111,4,5,777,65555,45,33,45]
_count2 = 0

for i in range(1,len(l2)):
    num = l2[i]
    j = i - 1
    while j >= 0 and l2[j] > num:
        _count2 += 1
        l2[j+1],l2[j] = l2[j],num
        j -= 1
print l2
print _count2



'''

方法1:
流程:
1. 从11索引为1的元素开始遍历每一个元素
2. 找到从遍历元素后到遍历list, 当遍历的元素小于当前元素则进行交换, 最终将最小的元素换到当前遍历的位置
3. 重复1, 2步骤

评注:
1. 排序正确
2. 使用类选择排序算法实现

方法2
流程:
1. 从l2索引为1的元素从左到右遍历
2. 依次比较当前遍历元素前的元素，如果比当前元素大，则向后移动，并记录当前位置，知道无元素比较时结束比较，并将遍历元素插入当比较元素位置后或list头
3. 重复1, 2步骤

评注:
1. 排序结果正确
2. 定义函数的方式实现功能, 并对列表进行相应检查，使用异常处理
3. 借助num, j变量使用的插入排序算法

加油
'''
